{"inkVersion":17,"root":[["ev","str","^apartment","/str","/ev",{"*":"0.c","flg":20},{"c":["\n","\n","ev","str","^apartment","/str","/ev",{"temp=":"location","re":true},{"->":"choose_reaction"},{"#f":7}]}],["ev","str","^house","/str","/ev",{"*":"1.c","flg":20},{"c":["\n","\n",{"->":"choose_reaction"},{"#f":7}]}],"done",{"choose_reaction":[["ev","str","^calm","/str","/ev",{"*":".^.c","flg":20},{"c":["\n","\n","ev","str","^calm","/str","/ev",{"temp=":"reaction","re":true},{"->":"main0"},{"#f":7}]}],["ev","str","^scared","/str","/ev",{"*":".^.c","flg":20},{"c":["\n","\n",{"->":"main0"},{"#f":7}]}],{"#f":3}],"main0":["^Trapped and hopeless, one of us was going to lose.","\n","^NEWLINE","\n","^I knew I was making a mistake as soon as the old wooden floor of his ",["G>","ev",{"VAR?":"location"},"str","^apartment","/str","==","/ev",[{"->":".^.b","c":true},{"b":["^apartment ",{"->":".^.^.^.10"},null]}],[{"->":".^.b"},{"b":["^ house",{"->":".^.^.^.10"},null]}],"nop","G<",null],"^ creaked beneath my shaking feet.","\n","^NEWLINE","\n","^I desperately needed the money and promised my sweet sister that I’d get us out of our hell hole of a home.","\n","^NEWLINE","\n","^I wasn’t your typical delinquent teen despite what others may believe; I just wanted a fresh start.","\n","^NEWPAGE","\n","^Yet another night had passed and I was still shaken up after my father’s return from the bar, the regular bruises, broken glass, tears and spite remained.","\n","^NEWPAGE","\n",["G>","ev",{"VAR?":"location"},"str","^apartment","/str","==","/ev",[{"->":".^.b","c":true},{"b":["^I had escaped and was seated in the café underneath our old grey building, the regular waiter handing me a cup of tea with a sad smile. ",{"->":".^.^.^.10"},null]}],[{"->":".^.b"},{"b":["^ I had escaped and was seated in the old diner down the street.",{"->":".^.^.^.10"},null]}],"nop","G<",null],"^","\n","^NEWLINE","\n","^As the warm tea flowed down my throat and the tears seeped into my t-shirt, I noticed a newspaper on the seat next to me.","\n","^NEWLINE","\n","^I mindlessly flipped through its faded pages and read “Medically retired veteran receives a $500,000 cash settlement over the tragic death of his only daughter”.","\n","^NEWPAGE","\n","^The paper went on to discuss how the drunken driver was only serving a miniscule amount of prison time as she came from a wealthy… the words began to blur… imagine all the things I could do with this money… I could finally escape.","\n","^NEWPAGE","\n","^I spent the next day doing my research and finally found the old man’s address.","\n","^NEWLINE","\n",["G>","ev",{"VAR?":"location"},"str","^apartment","/str","==","/ev",[{"->":".^.b","c":true},{"b":["^The funeral had been held in the cemetery right behind his apartment building. ",{"->":".^.^.^.10"},null]}],[{"->":".^.b"},{"b":["^ The funeral had been held in the garden of his abandoned-looking home.",{"->":".^.^.^.10"},null]}],"nop","G<",null],"^","\n","^NEWLINE","\n","^I plotted and concluded that this would be easily done as he was an elderly man with some kind of medical condition. I was there the next day.","\n","^NEWPAGE","\n",["G>","ev",{"VAR?":"location"},"str","^apartment","/str","==","/ev",[{"->":".^.b","c":true},{"b":[{"->":"apartment1"},{"->":".^.^.^.10"},null]}],[{"->":".^.b"},{"b":["^ ",{"->":"house1"},{"->":".^.^.^.10"},null]}],"nop","G<",null],"\n",{"#f":3}],"apartment1":["^Passing by the zooming cars, I speed-walked to the cemetery’s address… How will I find which apartment he lived in?","\n","^NEWLINE","\n","^A sigh of relief came over me as I noticed a bunch of sympathy flowers on the 5th floor’s fire escape. He must live there.","\n","^NEWLINE","\n","^As I was walking up the stairs on the fire escape, I felt my arm make contact with some sticky texture.","\n","^NEWLINE","\n","^I immediately turned my head to see what it was and found that I walked into a shiny spider web.","\n","^NEWPAGE","\n",["G>","ev",{"VAR?":"reaction"},"str","^scared","/str","==","/ev",[{"->":".^.b","c":true},{"b":[{"->":"scared1"},{"->":".^.^.^.10"},null]}],[{"->":".^.b"},{"b":["^ ",{"->":"calm1"},{"->":".^.^.^.10"},null]}],"nop","G<",null],"\n",{"#f":3}],"house1":["^The atmosphere was damp and peculiar noises filled the air around his home, eerily separating the property from its surroundings.","\n","^NEWLINE","\n","^As I was creeping around the bushes surrounding his home, I felt my arm make contact with some sticky texture.","\n","^NEWLINE","\n","^I immediately turned my head to see what it was and found that I walked into a shiny spider web.","\n","^NEWPAGE","\n",["G>","ev",{"VAR?":"reaction"},"str","^scared","/str","==","/ev",[{"->":".^.b","c":true},{"b":[{"->":"scared1"},{"->":".^.^.^.10"},null]}],[{"->":".^.b"},{"b":["^ ",{"->":"calm1"},{"->":".^.^.^.10"},null]}],"nop","G<",null],"\n",{"#f":3}],"scared1":["^Panic rose in my body and I felt goose bumps forming on my skin, I could not bear the thought of encountering a hairy eight legged vermin right now.","\n","^NEWLINE","\n","^I tried to balance my breathing, ignored the voices in my head that told me to turn around and go back and focused on my goal: drug him, get the money, leave and restart.","\n","^NEWPAGE","\n",{"->":"main"},{"#f":3}],"calm1":["^I breathed out a sigh of relief and laughed at myself for getting so riled up for nothing.","\n","^NEWLINE","\n","^Seeing a spider would be the least of my issues now.","\n","^NEWLINE","\n","^I shook my head and focused on my goal: drug him, get the money, leave and restart.","\n","^NEWPAGE","\n",{"->":"main"},{"#f":3}],"main":["^The same small build that I’ve despised my whole life proved itself handy as I entered his home through the kitchen window.","\n","^NEWLINE","\n","^I took a few moments to get accustomed to the darkness and looked around trying to determine where his room may be.","\n","^NEWPAGE","\n","^Tossing and turning, he was restless.","\n","^NEWLINE","\n","^His love, his daughter, the only one that has taken care of him in his hardest times was gone.","\n","^NEWLINE","\n","^He wondered: 'What’s the meaning of it all?'","\n","^NEWLINE","\n","^He had always been strong for her, he didn’t want her to feel sorry for him, she was supposed to live her life fully and enjoy it to the very end.","\n","^NEWLINE","\n","^How could someone so vibrant and full of light be lying lifeless in a grave?","\n","^NEWPAGE","\n","^I closed my eyes and listened for signs of life, after a few moments I heard light breathing from down the hall.","\n","^NEWLINE","\n","^I removed my shoes, secured my backpack and put the drugged chloroform cloth in a small plastic bag in my pocket.","\n","^NEWLINE","\n","^I tiptoed towards the sound of his breathing and found a white haired elderly man lying straight on his back.","\n","^NEWLINE","\n","^His hardened skin demonstrated his struggles, but despite having a strong form and a firm demeanor, his eyes, even in sleep, bared his sadness.","\n","^NEWPAGE","\n","^His sweet daughter had been replaced by a pile of money.","\n","^NEWLINE","\n","^Did they think that he could buy happiness?","\n","^NEWLINE","\n","^Maybe he could use it to build the orphanage that she had always been talking about.","\n","^NEWLINE","\n","^It would honor her name. He just wished he was able to say “goodbye”.","\n","^NEWPAGE","\n","^I cautiously entered his room and noticed a large portrait of him and a young woman smiling genuinely, she must’ve been his daughter and it looked like he loved her dearly.","\n","^NEWLINE","\n","^I then noticed a few holes on his walls; it looked like they’d been punched through.","\n","^NEWLINE","\n","^I quickly turned to check whether his hands were bloody and found him staring at me with eyes wide open.","\n","^NEWPAGE","\n","^All the blood drained from my body at that moment and my mouth went dry.","\n","^NEWPAGE","\n","^Thump, thump, thump.","\n","^NEWPAGE","\n","^My heart was beating hastily and my body was shaking with dread.","\n","^NEWLINE","\n","^Was I going to die?","\n","^NEWLINE","\n","^He calls me by a name that is not my own.","\n","^NEWLINE","\n","^Should I run?","\n","^NEWLINE","\n","^Should I walk towards him and pretend to be her?","\n","^NEWPAGE","\n","^Should I try drugging him now?","\n","^NEWLINE","\n","^Am I going to get out of this alive?","\n","^NEWLINE","\n","^As I was on the verge of fainting, he suddenly falls back to his former position with tears on his cheeks and I realize that he was merely dreaming. I’m alright.","\n","^NEWPAGE","\n","^Now do I go back to my initial plan or do I bolt?","\n","end",{"#f":3}],"global decl":["ev","str","^house","/str",{"VAR=":"location"},"str","^scared","/str",{"VAR=":"reaction"},"/ev","end",null],"#f":3}],"listDefs":{}}