{"inkVersion":17,"root":[["ev","str","^male","/str","/ev",{"*":"0.c","flg":20},{"c":["\n","\n","ev","str","^male","/str","/ev",{"temp=":"gender","re":true},{"->":"choose_topic"},{"#f":7}]}],["ev","str","^female","/str","/ev",{"*":"1.c","flg":20},{"c":["\n","\n",{"->":"choose_topic"},{"#f":7}]}],"done",{"choose_topic":[["ev","str","^psychology","/str","/ev",{"*":".^.c","flg":20},{"c":["\n","\n","ev","str","^psychology","/str","/ev",{"temp=":"topic","re":true},{"->":"main0"},{"#f":7}]}],["ev","str","^CS","/str","/ev",{"*":".^.c","flg":20},{"c":["\n","\n","ev","str","^CS","/str","/ev",{"temp=":"topic","re":true},{"->":"main0"},{"#f":7}]}],{"#f":3}],"main0":[["G>","ev",{"VAR?":"gender"},"str","^male","/str","==","/ev",[{"->":".^.b","c":true},{"b":[{"->":"male1"},{"->":".^.^.^.10"},null]}],[{"->":".^.b"},{"b":["^ ",{"->":"female1"},{"->":".^.^.^.10"},null]}],"nop","G<",null],"\n",{"#f":3}],"male1":["^Bright.","\n","^NEWLINE","\n","^That’s what described this early Sunday morning, the birds were chirping and singing their usual song.","\n","^NEWLINE","\n","^The wind, so fresh, lightly fanned his sun-tanned skin as he biked down the boardwalk.","\n","^NEWLINE","\n","^He had wanted to make a quick stop to pick up some dried fruits from the nature store on the corner.","\n","^NEWPAGE","\n","^Dried fruits always had his blood pumping before presentations and that’s exactly what he needed after having spent the whole previous day practicing for this presentation on: Genie the wild child and cognitive development or Algorithms and data structure.","\n","^NEWPAGE","\n",["G>","ev",{"VAR?":"topic"},"str","^CS","/str","==","/ev",[{"->":".^.b","c":true},{"b":[{"->":"CS1"},{"->":".^.^.^.10"},null]}],[{"->":".^.b"},{"b":["^ ",{"->":"psychology1"},{"->":".^.^.^.10"},null]}],"nop","G<",null],"\n",{"#f":3}],"CS1":["^Binary search","\n","^Linked list","\n","^Recursive function","\n","^Logarithmic complexity","\n",{"->":"male2"},{"#f":3}],"psychology1":["^Social isolation","\n","^Language acquisition","\n","^Lateralization","\n","^Lenneberg","\n",{"->":"male2"},{"#f":3}],"male2":["^NEWLINE","\n","^The words flew around his head like a pestering fly. He shook his head and attempted to clear his mind.","\n","^NEWLINE","\n","^He hopped off his bike for a single moment and left it on the curb as he made his way into the store.","\n","^NEWLINE","\n","^Whistling, he left the store and headed towards his bike only to find that it was not there.","\n","^NEWPAGE","\n","^Panicked, he thought to himself: how? I hadn’t been away from my bike for over a minute!","\n","^NEWLINE","\n","^Who would even steal a bike in this small town?","\n","^NEWLINE","\n","^This is the worst possible time for such a thing to happen. Why me?","\n","^NEWPAGE","\n","^Frantically he looked around to see if he could find it but there was nothing in the distance, not a single trace of the thin wheels, as though no bike had ever been ridden on these country roads.","\n","^NEWLINE","\n","^While he wouldn’t normally be so frantic about a material object, this bike held sentimental value to him.","\n","^NEWPAGE","\n","^And what made matters worse was that his notes were left on the bike and he would now have to find an alternative way to get to university on time.","\n","^NEWLINE","\n","^What a disaster, he thought.","\n","^NEWPAGE","\n","^2 weeks later","\n","^NEWPAGE","\n","^The aroma of coffee pervaded the air on this cool day.","\n","^NEWLINE","\n","^The smell in itself helped wake him up as he wandered around town.","\n","^NEWLINE","\n","^He had taken these last couple of weeks to appreciate the slower pace of life and took time to pay attention to details as he walked from place to place.","\n","^NEWPAGE","\n","^It helped him organize his time better and sort his head.","\n","^NEWLINE","\n","^He had almost forgotten about his bike until he saw it tied to the bench in front of his university’s café.","\n","^NEWLINE","\n","^The feelings of anger that ruined his day 2 weeks prior had re-emerged.","\n","^NEWPAGE","\n","^After a second of speculation and doubt, he was positive that it was his bike once he noticed the section on his seat cover that he had personally stitched back together after his young cousin thought it would be funny to poke a pair of keys into.","\n","^NEWLINE","\n","^He’d never thought that he’d be so happy to see that tear again.","\n","^NEWPAGE","\n","^By instinct, he was about to hop on his bike and ride home until he realized that he would have to undo the tie/ break the lock.","\n","^NEWLINE","\n","^He was so focused on breaking the lock free that he hadn’t noticed the tall blonde angrily running towards his crouched figure.","\n","^NEWLINE","\n","^He wasn’t prepared for this confrontation.","\n","^NEWPAGE","\n","^“What on earth are you doing?!” she yelled at him.","\n","^NEWLINE","\n","^He defensively told her that it was his bike and that she had stolen it from him.","\n","^NEWLINE","\n","^“Are you out of your mind? I bought this online last week.”","\n","^NEWLINE","\n","^She was now accusing him of stealing his own bike, how ironic.","\n","^NEWPAGE","\n","^She secured the lock again, gave him a stern look and walked away.","\n","^NEWLINE","\n","^He was so angry and began pacing around the area trying to think about how he was going to reclaim his property.","\n","^NEWLINE","\n","^Then it hit him, how would he be any better if he stole it back?","\n","^NEWLINE","\n","^She would be placed in the same situation that he was subjected to 2 weeks ago.","\n","^NEWPAGE","\n","^He remembered how that event ruined his day and felt a pang of guilt when considering taking his bike back.","\n","^NEWLINE","\n","^But it was his bike…he glanced back at it and…","\n","end",{"#f":3}],"female1":["^Bright.","\n","^NEWLINE","\n","^That’s what described this early Sunday morning, the birds were chirping and singing their usual song.","\n","^NEWLINE","\n","^The wind, so fresh, lightly fanned her sun-tanned skin as she biked down the boardwalk.","\n","^NEWLINE","\n","^She had wanted to make a quick stop to pick up some dried fruits from the nature store on the corner.","\n","^NEWPAGE","\n","^Dried fruits always had her blood pumping before presentations and that’s exactly what she needed after having spent the whole previous day practicing for this presentation on: Genie the wild child and cognitive development or Algorithms and data structure.","\n","^NEWPAGE","\n",["G>","ev",{"VAR?":"topic"},"str","^CS","/str","==","/ev",[{"->":".^.b","c":true},{"b":[{"->":"CS2"},{"->":".^.^.^.10"},null]}],[{"->":".^.b"},{"b":["^ ",{"->":"psychology2"},{"->":".^.^.^.10"},null]}],"nop","G<",null],"\n",{"#f":3}],"CS2":["^Binary search","\n","^Linked list","\n","^Recursive function","\n","^Logarithmic complexity","\n",{"->":"female2"},{"#f":3}],"psychology2":["^Social isolation","\n","^Language acquisition","\n","^Lateralization","\n","^Lenneberg","\n",{"->":"female2"},{"#f":3}],"female2":["^NEWLINE","\n","^The words flew around her head like a pestering fly. She shook her head and attempted to clear her mind.","\n","^NEWLINE","\n","^She hopped off her bike for a single moment and left it on the curb as she made her way into the store.","\n","^NEWLINE","\n","^Whistling, she left the store and headed towards her bike only to find that it was not there.","\n","^NEWPAGE","\n","^Panicked, she thought to herself: 'How? I hadn’t been away from my bike for over a minute!'","\n","^NEWLINE","\n","^Who would even steal a bike in this small town?","\n","^NEWLINE","\n","^This is the worst possible time for such a thing to happen. Why me?","\n","^NEWPAGE","\n","^Frantically she looked around to see if she could find it but there was nothing in the distance, not a single trace of the thin wheels, as though no bike had ever been ridden on these country roads.","\n","^NEWLINE","\n","^While she wouldn’t normally be so frantic about a material object, this bike held sentimental value to her.","\n","^NEWPAGE","\n","^And what made matters worse was that her notes were left on the bike and she would now have to find an alternative way to get to university on time.","\n","^NEWLINE","\n","^What a disaster, she thought.","\n","^NEWPAGE","\n","^2 weeks later","\n","^NEWPAGE","\n","^The aroma of coffee pervaded the air on this cool day.","\n","^NEWLINE","\n","^The smell in itself helped wake her up as she wandered around town.","\n","^NEWLINE","\n","^She had taken these last couple of weeks to appreciate the slower pace of life and took time to pay attention to details as she walked from place to place.","\n","^NEWPAGE","\n","^It helped her organize her time better and sort her head.","\n","^NEWLINE","\n","^She had almost forgotten about her bike until she saw it tied to the bench in front of her university’s café.","\n","^NEWLINE","\n","^The feelings of anger that ruined her day 2 weeks prior had re-emerged.","\n","^NEWPAGE","\n","^After a second of speculation and doubt, she was positive that it was her bike once he noticed the section on her seat cover that he had personally stitched back together after her young cousin thought it would be funny to poke a pair of keys into.","\n","^NEWLINE","\n","^She'd never thought that she'd be so happy to see that tear again.","\n","^NEWPAGE","\n","^By instinct, she was about to hop on her bike and ride home until she realized that she would have to undo the tie/ break the lock.","\n","^NEWLINE","\n","^She was so focused on breaking the lock free that she hadn’t noticed the tall blonde angrily running towards her crouched figure.","\n","^NEWLINE","\n","^She wasn’t prepared for this confrontation.","\n","^NEWPAGE","\n","^“What on earth are you doing?!” she yelled at her.","\n","^NEWLINE","\n","^She defensively told her that it was her bike and that she had stolen it from her.","\n","^NEWLINE","\n","^“Are you out of your mind? I bought this online last week.”","\n","^NEWLINE","\n","^She was now accusing her of stealing her own bike, how ironic.","\n","^NEWPAGE","\n","^She secured the lock again, gave her a stern look and walked away.","\n","^NEWLINE","\n","^She was so angry and began pacing around the area trying to think about how she was going to reclaim her property.","\n","^NEWLINE","\n","^Then it hit her, how would she be any better if she stole it back?","\n","^NEWLINE","\n","^They would be placed in the same situation that she was subjected to 2 weeks ago.","\n","^NEWPAGE","\n","^She remembered how that event ruined her day and felt a pang of guilt when considering taking her bike back.","\n","^NEWLINE","\n","^But it was her bike…she glanced back at it and…","\n","end",{"#f":3}],"global decl":["ev","str","^female","/str",{"VAR=":"gender"},"str","^psychology","/str",{"VAR=":"topic"},"/ev","end",null],"#f":3}],"listDefs":{}}